In [1]:
import numpy as np
import pandas as pd

In [9]:
df=pd.read_csv('C://Users/mishr/Desktop/excel files/mercedesbenz.csv')

In [10]:
df
#gives content of dataframe

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [12]:
#creating data frame using dictionary

weather_data={
    'day':['sunday','monday','tuesday','wednesday','thursday','friday','saturday'],
    'temprature':['31','38','42','21','30','40','28'],
    'event':['sunny','sunny','sunny','rainy','sunny','sunny','cloudy'],
    'windspeed':['6','6','2','13','5','12','21']
}
weather=pd.DataFrame(weather_data)

In [13]:
weather

         day temprature   event windspeed
0     sunday         31   sunny         6
1     monday         38   sunny         6
2    tuesday         42   sunny         2
3  wednesday         21   rainy        13
4   thursday         30   sunny         5
5     friday         40   sunny        12
6   saturday         28  cloudy        21

In [15]:
weather.shape

(7, 4)

In [20]:
rows,columns=weather.shape

In [21]:
rows

7

In [22]:
columns

4

In [23]:
weather.tail()

         day temprature   event windspeed
2    tuesday         42   sunny         2
3  wednesday         21   rainy        13
4   thursday         30   sunny         5
5     friday         40   sunny        12
6   saturday         28  cloudy        21

In [24]:
weather.head(2)

      day temprature  event windspeed
0  sunday         31  sunny         6
1  monday         38  sunny         6

In [25]:
weather[2:7]

         day temprature   event windspeed
2    tuesday         42   sunny         2
3  wednesday         21   rainy        13
4   thursday         30   sunny         5
5     friday         40   sunny        12
6   saturday         28  cloudy        21

In [26]:
weather.columns[0:2]

Index(['day', 'temprature'], dtype='object')

In [28]:
weather.day

0       sunday
1       monday
2      tuesday
3    wednesday
4     thursday
5       friday
6     saturday
Name: day, dtype: object

In [29]:
weather.event

0     sunny
1     sunny
2     sunny
3     rainy
4     sunny
5     sunny
6    cloudy
Name: event, dtype: object

In [30]:
type(weather.event)

pandas.core.series.Series

In [32]:
weather[['event','temprature']]

    event temprature
0   sunny         31
1   sunny         38
2   sunny         42
3   rainy         21
4   sunny         30
5   sunny         40
6  cloudy         28

In [34]:
weather.temprature.max()

'42'

In [36]:
weather.temprature.mean()

4483460186289.714

In [37]:
weather.describe()

           day temprature  event windspeed
count        7          7      7         7
unique       7          7      3         6
top     sunday         31  sunny         6
freq         1          1      5         2

In [38]:
weather[weather.temprature==weather.temprature.max()]

       day temprature  event windspeed
2  tuesday         42  sunny         2

In [39]:
weather[weather.temprature==weather.temprature.min()]

         day temprature  event windspeed
3  wednesday         21  rainy        13

In [46]:
weather.set_index('day',inplace=True)

In [47]:
weather

          temprature   event windspeed
day
sunday            31   sunny         6
monday            38   sunny         6
tuesday           42   sunny         2
wednesday         21   rainy        13
thursday          30   sunny         5
friday            40   sunny        12
saturday          28  cloudy        21

In [48]:
weather.reset_index

<bound method DataFrame.reset_index of           temprature   event windspeed
day
sunday            31   sunny         6
monday            38   sunny         6
tuesday           42   sunny         2
wednesday         21   rainy        13
thursday          30   sunny         5
friday            40   sunny        12
saturday          28  cloudy        21>

In [49]:
weather

          temprature   event windspeed
day
sunday            31   sunny         6
monday            38   sunny         6
tuesday           42   sunny         2
wednesday         21   rainy        13
thursday          30   sunny         5
friday            40   sunny        12
saturday          28  cloudy        21